Tekla Open API Reference for Tekla Structures 2025
PickerInputInterrupt Class
 The PickerInputInterrupt class represents the interruption of picking by the user (e.g. by pressing Escape while requested to pick points). Used for values asked by any UI.Picker.Pick* method where an interrupt happens by the user.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PickerInput
 Tekla.Structures.Drawing.PickerInputInterrupt
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class PickerInputInterrupt : PickerInput
Public Class PickerInputInterrupt
	Inherits PickerInput
The PickerInputInterrupt type exposes the following members.
Constructors
Name | Description
PickerInputInterrupt
 Creates a new PickerInputInterrupt instance representing the interruption of picking by the user.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides PickerInput.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace